// Напиши скрипт обробки покупки в магазині.
//   - Баланс користувача зберігається в змінній balance - отримати з інпуту
//   - Сумма покупки зберігається в змінній payment - отримати з інпуту
//   - Перед перевіркою вивести повідомлення на екран:
//   «Загальна вартість замовлення [число] кредитів. Перевіряємо кількість
//   доступних коштів на рахунку»
//  - Якщо сума покупки не перевищує баланс:
//      - Відняти з балансу суму покупки
//    - Вивести повідомлення «На рахунку залишилося [число] кредитів»
// - Якщо сума покупки перевищує баланс:
//     - Вивести повідомлення «На рахунку недостатньо коштів для проведення операції!»
//  - В кінці вивести повідомлення «Операція завершена»

// let balance = Number(prompt("Введіть суму коштів на рахунку"));
// console.log(balance);
// let payment = Number(prompt("Введіть суму коштів на яку хочете купити"));
// alert(`Загальна вартість замовлення ${payment} кредитів. Перевіряєио кількість доступних кредитів на рахунку`);

// if (balance > payment) {
//   balance -= payment;
//   alert(`дякую за покупку! На рахунку залишилось ${balance}`);
//   alert("Операція завершена!");
// } else {
//   alert("На рахунку недостатньо коштів дял проведення операції!");
//   alert("Операція завершена!");
// }

// ----------------------------------------------------------------------------
// Напиши скрит підрахунку суми покупки зі знижкою в залежності від витраченої суми за весь час (партнерська програма).
// Користувач вводить в інпут сумму витрачену в даному магазині і отримує розмір знижки як результат.
//  - Загальна сума витрачених коштів зберігається в змінній totalSpent
//  - Сума поточного платежа зберігається в змінній payment
//  - Знижка зберігається в змінній discount
// - Якщо витрачено від [100 до 1000) - бронзовий партнер, знижка 2%
//  - Якщо витрачено від [1000 до 5000) - срібний партнер, знижка 5%
//  - Якщо витрачено більше [5000 - золотий партнер, знижка 10%
//  - Якщо витрачено менше 100) - не партнер, знижка 0%

//  - В результаті вивести повідомлення
//  «Оформляемо замовлення на суму [сума] зі знижкою [знижка]%»

'Бронзовий партнер, знижка 2%'
'Срібний партнер, знижка 5%'
'Золотий партнер, знижка 10%'
'У вас ще немає партнерської знижки'
let totalSpent = Number(prompt("Сума яку ви витратили"));
let payment = Number(prompt("Поточний платіж"));
let discount = 0;

if (100 > 1000) {
  discount = 2;
  const sumeDiscount = totalSpent / 100 * discount;
  const equal = totalSpent - sumeDiscount
  alert(`Ви бронзовий партнер. Ваша знижка ${discount = 2}% .До сплати ${equal}`);
} 


